---
kind: method
id: M:Autodesk.Revit.Creation.Application.NewViewSet
source: html/d1f226d6-ad26-3871-2918-c75eadc27e0e.htm
---
# Autodesk.Revit.Creation.Application.NewViewSet Method

Creates a new instance of a View set.

## Syntax (C#)
```csharp
public ViewSet NewViewSet()
```